---
kind: property
id: P:Autodesk.Revit.DB.ScheduleSheetInstance.ScheduleId
source: html/368b680f-2b6e-9269-1f64-fa8e7e09b2cc.htm
---
# Autodesk.Revit.DB.ScheduleSheetInstance.ScheduleId Property

Id of the primary schedule that generates this ScheduleInstance.

## Syntax (C#)
```csharp
public ElementId ScheduleId { get; }
```